Autodesk.Revit.DB.Structure.RebarContainerType.GetOrCreateRebarContainerType(Autodesk.Revit.DB.Document,System.String)
Creates or returns a RebarContainerType object with a given name.
aDoc:
The document.
name:
Name of the type.
Returns:
The type id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerType.CreateDefaultRebarContainerType(Autodesk.Revit.DB.Document)
Creates a new RebarContainerType object with a default name.
aDoc:
The document.
Returns:
The newly created type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016